results/performance/calibration/aerospike_sow2-production_aws-cassandra-503-100-threads_0_tCBmmP06/0_load.txt
bin/ycsb load cassandra4-cql -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p hosts=172.31.9.10,172.31.14.26,172.31.13.34,172.31.4.198,172.31.15.208,172.31.5.209 -p cassandra.keyspace=ycsb -p cassandra.username=benchant -p cassandra.password=Performance99 -p cassandra.initDefaultTable=false -p cassandra.useSecureBundle=false -p  cassandra.writeconsistencylevel=QUORUM -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=50000000 -p operationcount=2800000000 -p fieldcount=10 -p fieldlength=200 -p requestdistribution=uniform-growing -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.06 -p insertproportion=0.4 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0  -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 
/usr/lib/jvm/java-1.8.0-openjdk-amd64/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/cassandra4-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/cassandra4-binding/lib/asm-tree-9.1.jar:/binary/ycsb/cassandra4-binding/lib/asm-analysis-9.1.jar:/binary/ycsb/cassandra4-binding/lib/netty-handler-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/netty-codec-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/slf4j-simple-1.7.21.jar:/binary/ycsb/cassandra4-binding/lib/jackson-annotations-2.12.2.jar:/binary/ycsb/cassandra4-binding/lib/jackson-core-2.12.2.jar:/binary/ycsb/cassandra4-binding/lib/jnr-posix-3.1.5.jar:/binary/ycsb/cassandra4-binding/lib/asm-9.1.jar:/binary/ycsb/cassandra4-binding/lib/spotbugs-annotations-3.1.12.jar:/binary/ycsb/cassandra4-binding/lib/json-20090211.jar:/binary/ycsb/cassandra4-binding/lib/netty-buffer-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/netty-common-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/jffi-1.3.1-native.jar:/binary/ycsb/cassandra4-binding/lib/reactive-streams-1.0.3.jar:/binary/ycsb/cassandra4-binding/lib/netty-transport-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/java-driver-core-4.13.0.jar:/binary/ycsb/cassandra4-binding/lib/asm-commons-9.1.jar:/binary/ycsb/cassandra4-binding/lib/java-driver-query-builder-4.13.0.jar:/binary/ycsb/cassandra4-binding/lib/jsr305-3.0.2.jar:/binary/ycsb/cassandra4-binding/lib/jnr-constants-0.10.1.jar:/binary/ycsb/cassandra4-binding/lib/metrics-core-4.1.18.jar:/binary/ycsb/cassandra4-binding/lib/netty-resolver-4.1.60.Final.jar:/binary/ycsb/cassandra4-binding/lib/jackson-databind-2.12.2.jar:/binary/ycsb/cassandra4-binding/lib/config-1.4.1.jar:/binary/ycsb/cassandra4-binding/lib/esri-geometry-api-1.2.1.jar:/binary/ycsb/cassandra4-binding/lib/java-driver-shaded-guava-25.1-jre-graal-sub-1.jar:/binary/ycsb/cassandra4-binding/lib/asm-util-9.1.jar:/binary/ycsb/cassandra4-binding/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/cassandra4-binding/lib/jffi-1.3.1.jar:/binary/ycsb/cassandra4-binding/lib/cassandra4-binding-0.18.0-SNAPSHOT.jar:/binary/ycsb/cassandra4-binding/lib/jcip-annotations-1.0-1.jar:/binary/ycsb/cassandra4-binding/lib/native-protocol-1.5.0.jar:/binary/ycsb/cassandra4-binding/lib/jnr-a64asm-1.0.0.jar:/binary/ycsb/cassandra4-binding/lib/jnr-x86asm-1.0.2.jar:/binary/ycsb/cassandra4-binding/lib/jnr-ffi-2.2.2.jar:/binary/ycsb/cassandra4-binding/lib/HdrHistogram-2.1.12.jar:/binary/ycsb/cassandra4-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -db site.ycsb.db.cassandra4.CassandraCQLClient -s -p hosts=172.31.9.10,172.31.14.26,172.31.13.34,172.31.4.198,172.31.15.208,172.31.5.209 -p cassandra.keyspace=ycsb -p cassandra.username=benchant -p cassandra.password=Performance99 -p cassandra.initDefaultTable=false -p cassandra.useSecureBundle=false -p cassandra.writeconsistencylevel=QUORUM -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=50000000 -p operationcount=2800000000 -p fieldcount=10 -p fieldlength=200 -p requestdistribution=uniform-growing -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.06 -p insertproportion=0.4 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -load
Command line: -db site.ycsb.db.cassandra4.CassandraCQLClient -s -p hosts=172.31.9.10,172.31.14.26,172.31.13.34,172.31.4.198,172.31.15.208,172.31.5.209 -p cassandra.keyspace=ycsb -p cassandra.username=benchant -p cassandra.password=Performance99 -p cassandra.initDefaultTable=false -p cassandra.useSecureBundle=false -p cassandra.writeconsistencylevel=QUORUM -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=50000000 -p operationcount=2800000000 -p fieldcount=10 -p fieldlength=200 -p requestdistribution=uniform-growing -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.06 -p insertproportion=0.4 -p scanproportion=0.0 -p maxscanlength=1000 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
insertstart, insertcount, recordcount: 0, 50000000, 50000000
CoreWorkload init --- orderedinserts: true
Starting test.
[Thread-30] INFO site.ycsb.db.cassandra4.CassandraCQLClient - setting read (and default) Consistency to 'QUORUM'
[Thread-30] INFO site.ycsb.db.cassandra4.CassandraCQLClient - setting write Consistency to 'QUORUM'
2025-03-08 07:02:51:303 0 sec: 0 operations; est completion in 0 second 
[Thread-30] INFO com.datastax.oss.driver.internal.core.DefaultMavenCoordinates - DataStax Java driver for Apache Cassandra(R) (com.datastax.oss:java-driver-core) version 4.13.0
[s0-admin-0] INFO com.datastax.oss.driver.internal.core.time.Clock - Using native clock for microsecond precision
[s0-io-2] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.13.34:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-3] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.14.26:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-5] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.13.34:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-4] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.5.209:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-8] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.4.198:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-6] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.9.10:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[s0-io-7] WARN com.datastax.oss.driver.api.core.auth.PlainTextAuthProviderBase - [] /172.31.15.208:9042 did not send an authentication challenge; This is suspicious because the driver expects authentication
[Thread-30] INFO site.ycsb.db.cassandra4.CassandraCQLClient - Connected to cluster: Optional[benchANT Cluster]

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-03-08 07:03:01:289 10 sec: 973409 operations; 97340.9 current ops/sec; est completion in 8 minutes [INSERT: Count=973544, Max=91967, Min=401, Avg=919.14, 90=1287, 99=3439, 99.9=7799, 99.99=87231] 
2025-03-08 07:03:11:289 20 sec: 2229021 operations; 125561.2 current ops/sec; est completion in 7 minutes [INSERT: Count=1255529, Max=11615, Min=399, Avg=794.58, 90=1023, 99=1648, 99.9=4175, 99.99=8735] 
2025-03-08 07:03:21:289 30 sec: 3512343 operations; 128332.2 current ops/sec; est completion in 6 minutes [INSERT: Count=1283327, Max=10735, Min=410, Avg=777.38, 90=980, 99=1299, 99.9=3965, 99.99=9351] 
2025-03-08 07:03:31:289 40 sec: 4776312 operations; 126396.9 current ops/sec; est completion in 6 minutes [INSERT: Count=1263980, Max=13007, Min=407, Avg=789.39, 90=998, 99=1329, 99.9=4227, 99.99=7459] 
2025-03-08 07:03:41:289 50 sec: 6033306 operations; 125699.4 current ops/sec; est completion in 6 minutes [INSERT: Count=1256972, Max=9879, Min=401, Avg=793.76, 90=1000, 99=1351, 99.9=4859, 99.99=6919] 
2025-03-08 07:03:51:289 60 sec: 7293990 operations; 126068.4 current ops/sec; est completion in 5 minutes [INSERT: Count=1260672, Max=9287, Min=397, Avg=791.43, 90=1000, 99=1348, 99.9=5563, 99.99=7427] 
2025-03-08 07:04:01:289 70 sec: 8495899 operations; 120190.9 current ops/sec; est completion in 5 minutes [INSERT: Count=1201914, Max=13775, Min=387, Avg=830.25, 90=1051, 99=1960, 99.9=5215, 99.99=8415] 
2025-03-08 07:04:11:289 80 sec: 9709589 operations; 121369 current ops/sec; est completion in 5 minutes [INSERT: Count=1213713, Max=10503, Min=394, Avg=822.15, 90=1040, 99=1464, 99.9=5371, 99.99=7371] 
2025-03-08 07:04:21:289 90 sec: 10931187 operations; 122159.8 current ops/sec; est completion in 5 minutes [INSERT: Count=1221584, Max=10479, Min=401, Avg=816.81, 90=1028, 99=1472, 99.9=5711, 99.99=7787] 
2025-03-08 07:04:31:289 100 sec: 12157434 operations; 122624.7 current ops/sec; est completion in 5 minutes [INSERT: Count=1226257, Max=12055, Min=371, Avg=813.7, 90=1024, 99=1434, 99.9=5855, 99.99=8239] 
2025-03-08 07:04:41:289 110 sec: 13373306 operations; 121587.2 current ops/sec; est completion in 5 minutes [INSERT: Count=1215863, Max=11663, Min=417, Avg=820.67, 90=1037, 99=1466, 99.9=5211, 99.99=8183] 
2025-03-08 07:04:51:289 120 sec: 14585269 operations; 121196.3 current ops/sec; est completion in 4 minutes [INSERT: Count=1211953, Max=14695, Min=402, Avg=823.31, 90=1049, 99=1500, 99.9=5779, 99.99=7183] 
2025-03-08 07:05:01:289 130 sec: 15803217 operations; 121794.8 current ops/sec; est completion in 4 minutes [INSERT: Count=1217971, Max=11319, Min=397, Avg=819.26, 90=1042, 99=1506, 99.9=5799, 99.99=9199] 
2025-03-08 07:05:11:289 140 sec: 17001894 operations; 119867.7 current ops/sec; est completion in 4 minutes [INSERT: Count=1198675, Max=10527, Min=393, Avg=832.45, 90=1069, 99=1559, 99.9=5719, 99.99=6975] 
2025-03-08 07:05:21:289 150 sec: 18199087 operations; 119719.3 current ops/sec; est completion in 4 minutes [INSERT: Count=1197173, Max=13647, Min=410, Avg=833.52, 90=1065, 99=1565, 99.9=6219, 99.99=7963] 
2025-03-08 07:05:31:289 160 sec: 19420103 operations; 122101.6 current ops/sec; est completion in 4 minutes [INSERT: Count=1221044, Max=12575, Min=389, Avg=817.18, 90=1034, 99=1491, 99.9=5919, 99.99=8919] 
2025-03-08 07:05:41:289 170 sec: 20625893 operations; 120579 current ops/sec; est completion in 4 minutes [INSERT: Count=1205775, Max=17951, Min=393, Avg=827.54, 90=1057, 99=1531, 99.9=5463, 99.99=7979] 
2025-03-08 07:05:51:289 180 sec: 21821606 operations; 119571.3 current ops/sec; est completion in 3 minutes [INSERT: Count=1195713, Max=11719, Min=406, Avg=834.53, 90=1069, 99=1537, 99.9=5671, 99.99=8295] 
2025-03-08 07:06:01:289 190 sec: 23031614 operations; 121000.8 current ops/sec; est completion in 3 minutes [INSERT: Count=1210004, Max=10471, Min=407, Avg=824.64, 90=1047, 99=1542, 99.9=5355, 99.99=8103] 
2025-03-08 07:06:11:289 200 sec: 24248381 operations; 121676.7 current ops/sec; est completion in 3 minutes [INSERT: Count=1216737, Max=10559, Min=405, Avg=820.06, 90=1042, 99=1485, 99.9=5083, 99.99=8003] 
2025-03-08 07:06:21:289 210 sec: 25448623 operations; 120024.2 current ops/sec; est completion in 3 minutes [INSERT: Count=1200252, Max=11703, Min=401, Avg=831.36, 90=1061, 99=1558, 99.9=5619, 99.99=8147] 
2025-03-08 07:06:31:289 220 sec: 26645127 operations; 119650.4 current ops/sec; est completion in 3 minutes [INSERT: Count=1196526, Max=12495, Min=399, Avg=833.98, 90=1067, 99=1549, 99.9=5727, 99.99=8439] 
2025-03-08 07:06:41:289 230 sec: 27853391 operations; 120826.4 current ops/sec; est completion in 3 minutes [INSERT: Count=1208242, Max=13223, Min=399, Avg=825.81, 90=1050, 99=1541, 99.9=6255, 99.99=8983] 
2025-03-08 07:06:51:290 240 sec: 29059841 operations; 120645 current ops/sec; est completion in 2 minutes [INSERT: Count=1206447, Max=10623, Min=410, Avg=827.13, 90=1053, 99=1569, 99.9=6011, 99.99=7423] 
2025-03-08 07:07:01:289 250 sec: 30267685 operations; 120784.4 current ops/sec; est completion in 2 minutes [INSERT: Count=1207860, Max=12959, Min=405, Avg=826.1, 90=1042, 99=1497, 99.9=5927, 99.99=7543] 
2025-03-08 07:07:11:289 260 sec: 31469260 operations; 120157.5 current ops/sec; est completion in 2 minutes [INSERT: Count=1201573, Max=14615, Min=409, Avg=830.45, 90=1067, 99=1563, 99.9=5531, 99.99=8783] 
2025-03-08 07:07:21:289 270 sec: 32677888 operations; 120862.8 current ops/sec; est completion in 2 minutes [INSERT: Count=1208628, Max=9935, Min=378, Avg=825.57, 90=1051, 99=1515, 99.9=5251, 99.99=6855] 
2025-03-08 07:07:31:289 280 sec: 33888209 operations; 121032.1 current ops/sec; est completion in 2 minutes [INSERT: Count=1210324, Max=12695, Min=398, Avg=824.44, 90=1047, 99=1521, 99.9=5691, 99.99=8791] 
2025-03-08 07:07:41:289 290 sec: 35091449 operations; 120324 current ops/sec; est completion in 2 minutes [INSERT: Count=1203230, Max=12935, Min=407, Avg=829.25, 90=1059, 99=1561, 99.9=5587, 99.99=7571] 
2025-03-08 07:07:51:289 300 sec: 36287762 operations; 119631.3 current ops/sec; est completion in 1 minute [INSERT: Count=1196333, Max=13479, Min=403, Avg=834.12, 90=1068, 99=1558, 99.9=5711, 99.99=8487] 
2025-03-08 07:08:01:289 310 sec: 37480932 operations; 119317 current ops/sec; est completion in 1 minute [INSERT: Count=1193160, Max=43999, Min=416, Avg=836.31, 90=1053, 99=1546, 99.9=6475, 99.99=14855] 
2025-03-08 07:08:11:289 320 sec: 38689152 operations; 120822 current ops/sec; est completion in 1 minute [INSERT: Count=1208222, Max=10103, Min=404, Avg=825.87, 90=1050, 99=1529, 99.9=5735, 99.99=7259] 
2025-03-08 07:08:21:289 330 sec: 39886696 operations; 119754.4 current ops/sec; est completion in 1 minute [INSERT: Count=1197519, Max=12367, Min=412, Avg=833.24, 90=1062, 99=1543, 99.9=5711, 99.99=8791] 
2025-03-08 07:08:31:289 340 sec: 41092188 operations; 120549.2 current ops/sec; est completion in 1 minute [INSERT: Count=1205498, Max=18463, Min=400, Avg=827.72, 90=1049, 99=1530, 99.9=6039, 99.99=9679] 
2025-03-08 07:08:41:289 350 sec: 42285583 operations; 119339.5 current ops/sec; est completion in 1 minute [INSERT: Count=1193402, Max=12711, Min=395, Avg=836.13, 90=1075, 99=1584, 99.9=5599, 99.99=8935] 
2025-03-08 07:08:51:289 360 sec: 43485026 operations; 119944.3 current ops/sec; est completion in 54 seconds [INSERT: Count=1199449, Max=13327, Min=408, Avg=831.93, 90=1065, 99=1571, 99.9=5867, 99.99=8791] 
2025-03-08 07:09:01:289 370 sec: 44684751 operations; 119972.5 current ops/sec; est completion in 45 seconds [INSERT: Count=1199718, Max=9919, Min=405, Avg=831.73, 90=1067, 99=1592, 99.9=5567, 99.99=7859] 
2025-03-08 07:09:11:289 380 sec: 45884373 operations; 119962.2 current ops/sec; est completion in 35 seconds [INSERT: Count=1199614, Max=15423, Min=394, Avg=831.8, 90=1058, 99=1540, 99.9=5735, 99.99=8223] 
2025-03-08 07:09:21:289 390 sec: 47081835 operations; 119746.2 current ops/sec; est completion in 25 seconds [INSERT: Count=1197474, Max=12287, Min=408, Avg=833.29, 90=1063, 99=1558, 99.9=6063, 99.99=9295] 
2025-03-08 07:09:31:289 400 sec: 48294985 operations; 121315 current ops/sec; est completion in 15 seconds [INSERT: Count=1213149, Max=12415, Min=404, Avg=822.5, 90=1042, 99=1524, 99.9=5827, 99.99=8599] 
2025-03-08 07:09:41:289 410 sec: 49484745 operations; 118976 current ops/sec; est completion in 5 second [INSERT: Count=1189739, Max=10047, Min=410, Avg=838.7, 90=1072, 99=1572, 99.9=5931, 99.99=8287] 
2025-03-08 07:09:47:963 416 sec: 50000000 operations; 77203.33 current ops/sec; [CLEANUP: Count=100, Max=2015231, Min=1, Avg=20148.92, 90=3, 99=10, 99.9=2015231, 99.99=2015231] [INSERT: Count=515241, Max=9455, Min=367, Avg=831.09, 90=1073, 99=1540, 99.9=5147, 99.99=8583] 
[OVERALL], RunTime(ms), 416674
[OVERALL], Throughput(ops/sec), 119997.88803717055
[TOTAL_GCS_PS_Scavenge], Count, 964
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 4182
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.0036623355428944
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 19
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.004559919745412481
[TOTAL_GCs], Count, 965
[TOTAL_GC_TIME], Time(ms), 4201
[TOTAL_GC_TIME_%], Time(%), 1.008222255288307
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 20148.92
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 2015231
[CLEANUP], 50thPercentileLatency(us), 1
[CLEANUP], 90thPercentileLatency(us), 3
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 10
[CLEANUP], 99.99PercentileLatency(us), 2015231
[CLEANUP], 99.99999PercentileLatency(us), 2015231
[INSERT], Operations, 50000000
[INSERT], AverageLatency(us), 824.71390044
[INSERT], MinLatency(us), 367
[INSERT], MaxLatency(us), 91967
[INSERT], 50thPercentileLatency(us), 771
[INSERT], 90thPercentileLatency(us), 1048
[INSERT], 95thPercentileLatency(us), 1179
[INSERT], 99thPercentileLatency(us), 1563
[INSERT], 99.99PercentileLatency(us), 8559
[INSERT], 99.99999PercentileLatency(us), 91327
[INSERT], Return=OK, 50000000